Repository: tsampi/tsampi-0
Catalog: tsampi/pypy/lib_python-bak/PyDbLite-master/docs/source/locale/*/LC_MESSAGES/pythonengine.po
Languages: fr

source: Pure-Python engine
fr: Moteur pur-Python

source: The pure-Python engine consists of one module, pydblite.py. To use it, import the class :class:`Base <pydblite.pydblite._Base>` from this module:
fr: Le moteur pur-Python consiste en un module unique, pydblite.py. Pour l'utiliser, importer la classe :class:`Base <pydblite.pydblite._Base>` depuis ce module:

source: Create a database instance, passing it a path in the file system
fr: créer une instance de base de données, en donnant un nom de fichier comme argument

source: For a new database, define the field names
fr: Pour une nouvelle base, définissez les noms des champs

source: You don't have to define the field types. Any value will be accepted as long as it can be serialized by the cPickle module:
fr: Vous n'avez pas à définir le type des champs. PyDbLite accepte toute valeur qui peut être sérialisée par le module cPickle

source: :func:`db.exists() <pydblite.pydblite._Base.exists>` indicates if the base exists.
fr: :func:`db.exists() <pydblite.pydblite._Base.exists>` indique si la base existe exists.

source: if the base exists, open it
fr: si la base existe déjà, pour l'ouvrir

source: You can pass a parameter "mode" to the :func:`create() <pydblite.pydblite._Base.create>` method, to specify what you want to do if the base already exists in the file system
fr: on peut passer un paramètre "mode" à la méthode :func:`create() <pydblite.pydblite._Base.create>`pour indiquer ce qu'il faut faire si la base existe déjà sur le disque

source: mode = "open" : :python:`db.create('name', 'age', 'size', mode="open")` opens the database and ignores the field definition
fr: mode = "open" : :python:`db.create('name', 'age', 'size', mode="open")` ouvre la base en ignorant la définition des champs

source: mode = "override" : :python:`db.create('name', 'age', 'size', mode="override")` erases the existing base and creates a new one with the field definition
fr: mode = "override" : :python:`db.create('name', 'age', 'size', mode="override")` efface la base existante et en crée une nouvelle avec les définitions de champs

source: if :python:`mode` is not specified and the base already exists, an :python:`IOError` is raised
fr: si le :python:`mode` n'est pas précisé et que la base existe déjà, une exception :python:`IOError` est déclenchée

source: by keywords
fr: par mots-clés

source: If some fields are missing, they are initialized with the value None
fr: Si certains champs manquent, ils sont initialisés à la valeur None

source: by positional arguments
fr: par arguments positionnels

source: The arguments must be provided in the same order as in the :python:`create()` method
fr: Les arguments doivent être fournis dans le même ordre que dans la méthode :python:`create()`

source: save the changes on disk
fr: pour sauvegarder les changements sur le disque

source: If you don't commit the changes, the insertion, deletion and update operations will not be saved on disk. As long as changes are not commited, use :python:`open()` to restore the values as they are currently on disk (this is equivalent to rollback in transactional databases)
fr: Si vous ne confirmez pas les changements, les opérations d'insertion, de suppression et de mise à jour ne seront pas sauvegardés sur le disque

source: delete a record
fr: pour supprimer un enregistrement

source: or, if you know the record identifier
fr: ou, si vous connaissez l'identifiant

source: to delete a list of records
fr: pour supprimer une liste d'enregistrements

source: where list_of_records can be any iterable (list, tuple, set, etc) yielding records
fr: liste_d_enregistrements peut être n'importe quel itérable (liste, tuple, set, etc) qui produit des enregistrements

source: besides the fields passed to the :python:`create()` method, an internal field called :python:`__id__` is added. It is an integer which is guaranteed to be unique and unchanged for each record in the base, so that it can be used as the record identifier
fr: En plus des champs passés à la méthode :python:`create()`, un champ interne appelé __id__ est ajouté. C'est un entier, unique et inchangé pour chaque enregistrement, il peut donc être utilisé comme identifiant pour l'enregistrement

source: another internal field called :python:`__version__` is also managed by the database engine. It is an integer which is set to 0 when the record is created, then incremented by 1 each time the record is updated. This is used to detect concurrency control, for instance in a web application where 2 users select the same record and want to update it at the same time
fr: un autre champ interne appelé :python:`__version__` est également géré par le moteur de base de données. Il s'agit d'un entier qui est initialisé à 0 quand l'enregistrement est créé, et incrémenté de 1 à chaque fois que l'enregistrement est mis à jour. Ceci sert pour la détection des accès concurrents, par exemple dans une application web dans laquelle deux utilisateurs veulent mettre à jour le même enregistrement en même temps.

source: Selection
fr: Sélection

source: The instance of Base is a Python iterator
fr: L'instance de Base est un itérateur sur les enregistrements

source: to iterate on all the records
fr: Pour itérer sur tous les enregistrements

source: Direct access
fr: Accès direct

source: A record can be accessed by its identifier
fr: On peut accéder directement à un enregistrement par son identifiant

source: returns the record such that :python:`record['__id__'] == rec_id`
fr: retourne l'enregistrement tel que :python:`record['__id__'] == rec_id`

source: Simple selections
fr: Sélection simples

source: :python:`db(key1=val1, key2=val2)` returns the list of records where the keys take the given values
fr: :python:`db(key1=val1, key2=val2)` renvoie la liste des enregistrements dont les clés ont les valeurs données

source: :python:`db(key) >= val` returns an iterator on all records where the value of the field key is greater than or equal to val.
fr: :python:`db(key) >= val` retourne un itérateur sur tous les enregistrements pour lesquels la val du champ cle est supérieure ou égale à val.

source: Example
fr: Exemple

source: such "rich comparison" operations can be combined with & (AND) and | (OR)
fr: ces "comparaisons riches" peuvent être combinées avec des & (et) et des | (ou)

source: List comprehension
fr: Listes en intension

source: The selection of records can use Python list comprehension syntax
fr: la sélection d'enregistrements peut utiliser la syntaxe des listes en intension ("list comprehensions") de Python

source: Returns the records in the base where the age is between 18 and 30, and size is below 2 meters. The record is a dictionary, where the key is the field name and value is the field value
fr: retourne les enregistrements de la base pour lesquels l'âge est compris entre 18 et 30 ans, et la taille est inférieure à 2 mètres. L'enregistrement est un dictionnaire, où la clé est le nom de champ et la valeur est la valeur de ce champ

source: Python generator expression syntax can also be used
fr: la syntaxe des générateurs d'expression Python peut aussi être utilisée

source: iterates on the records where the name is one of 'homer' or 'marge'
fr: itère sur les enregistrements dont le nom est 'homer' ou 'marge'

source: To speed up selections, an index can be created on a field using :func:`create_index('field') <pydblite.pydblite._Base.create_index>`
fr: Pour accélérer les sélections, un index peut être créé sur un champ :func:`create_index('field') <pydblite.pydblite._Base.create_index>`

source: When an index is created, the database instance has an attribute (here :python:`_age` : note the heading underscore, to avoid name conflicts with internal names). This attribute is a dictionary-like object, where keys are the values taken by the field, and values are the records whose field values are egal to the key :
fr: Quand un index est créé, l'instance de la base de données a un attribut (ici _age : noter le signe de soulignement initial, pour éviter les conflits de noms avec des noms internes). Cet attribut est un objet de type dictionnaire, où les clés sont les valeurs prises par le champ, et les valeurs sont les enregistrements dont le champ a la même valeur que la clé :

source: :python:`records = db._age[23]` returns the list of records with :python:`age == 23`
fr: :python:`records = db._age[23]` retourne la liste des enregistrements avec :python:`age == 23`

source: If no record has this value, lookup by this value returns an empty list
fr: Si aucun enregistrement n'a cette valeur, la recherche par cette valeur retourne une liste vide

source: The index supports iteration on the field values, and the :python:`keys()` method returns all existing values for the field
fr: L'index supporte l'itération sur les valeurs du champ, et la méthode :python:`keys()` retourne toutes les valeurs existantes pour le champ

source: Other attributes and methods
fr: Autres attributs et méthodes

source: :func:`add_field('new_field'[,default=v]) <pydblite.pydblite._Base.add_field>`: adds a new field to an existing base. :python:`default` is an optional default value ; set to :python:`None` if not specified
fr: :func:`add_field('new_field'[,default=v]) <pydblite.pydblite._Base.add_field>`: ajoute un nouveau champ à la base de données. :python:`default` est une valeur par défaut ; elle vaut :python:`None` si elle n'est pas précisée

source: :func:`drop_field('field') <pydblite.pydblite._Base.drop_field>`: drops an existing field
fr: :func:`drop_field('field') <pydblite.pydblite._Base.drop_field>`: supprime un champ existant

source: :attr:`db.path <pydblite.pydblite._Base.path>`: the path of the database in the file system
fr: :attr:`db.path <pydblite.pydblite._Base.path>`: the chemin de la base de données dans le système de fichiers

source: :attr:`db.name <pydblite.pydblite._Base.name>`: the database name : the basename of the path, stripped of its extension
fr: :attr:`db.name <pydblite.pydblite._Base.name>`: le nom de la base de données : le nom de base du chemin (sans le répertoire), auquel on a enlevé l'extension

source: :attr:`db.fields <pydblite.pydblite._Base.fields>`: the list of the fields (does not include the internal fields :python:`__id__` and :python:`__version__`)
fr: :attr:`db.fields <pydblite.pydblite._Base.fields>`: la liste des champs (n'inclut pas les champs internes :python:`__id__` et :python:`__version__`)

source: :python:`len(db)` : number of records in the base
fr: :python:`len(db)` : nombre d'enregistrements dans la base
