Repository: tsampi/tsampi-0
Catalog: tsampi/pypy/lib_python-bak/PyDbLite-master/docs/source/locale/*/LC_MESSAGES/sqliteengine.po
Languages: fr

source: SQLite adapter
fr: Adapteur SQLite

source: The main difference with the pure-Python module is the syntax to identify a database and a table, and the need to specify field types on base creation
fr: La seule différence avec le module en pur Python est la syntaxe pour identifier une table et la nécessité de spécifier le type des champs quand on crée une base

source: For compliance with SQLite vocabulary, the module defines two classes, :class:`Database <pydblite.sqlite.Database>` and :class:`Table <pydblite.sqlite.Table>`
fr: Pour rester cohérent avec le vocabulaire SQLite, le module définit deux classes, :class:`Database <pydblite.sqlite.Database>` et :class:`Table <pydblite.sqlite.Table>`

source: :python:`Database(db_path[,**kw])` : db_path is the database path in the file system. The keyword arguments are the same as for the method :python:`connect()` of the Python built-in module sqlite3
fr: :python:`Database(db_path[,**kw])` : db_path est le chemin de la base de données dans le système de fichiers. Les arguments par mots-clés sont les mêmes que pour la méthode :python:`connect()` du module Python pour SQLite

source: Instances of Database are dictionary-like objects, where keys are the table names and values are instances of the :class:`Table <pydblite.sqlite.Table>` class
fr: Les instances de Database sont des objets similaires à des dictionnaires, où les clés sont les noms des tables et les valeurs sont des instances de la classe :class:`Table <pydblite.sqlite.Table>`

source: :python:`db["foo"]` returns the instance of the Table class for table "foo"
fr: :python:`db["foo"]` renvoie l'instance de la classe Table pour la table"foo"

source: :python:`db.keys()` returns the table names
fr: :python:`db.keys()` renvoie les noms de tables

source: :python:`if "foo" in db` tests if table "foo" exists in the database
fr: :python:`if "foo" in db` teste si la table "foo" existe dans la base de données

source: :python:`del db["foo"]` drops the table "foo"
fr: :python:`del db["foo"]` supprime la table "foo"

source: To create a new table
fr: Pour créer une nouvelle table

source: The fields must be 2-element tuples :python:`(field_name, field_type)` where field_type is an SQLite field type
fr: Les champs doivent être des tuples à 2 éléments (nom_champ, type_champ) où type_champ est un type de champ SQLite

source: If other information needs to be provided, put it in the second argument, using the SQL syntax for SQLite
fr: S'il faut fournir d'autres informations, les mettre dans le deuxième argument, avec la syntaxe SQL propre à SQLite

source: The optional keyword argument :python:`mode` specifies what you want to do if a table of the same name already exists in the database
fr: Le mot-clé optionnel :python:`mode` spécifie ce qu'il faut faire si une table du même nom existe déjà

source: :python:`mode="open"` opens the table and ignores the field definition
fr: :python:`mode="open"` ouvre la table et ignore les définitions de champs

source: :python:`mode="override"` erases the existing table and creates a new one with the field definition
fr: :python:`mode="override"` efface la table existante et en crée une nouvelle avec les définitions de champs

source: if :python:`mode` is not specified and the table already exists, an :python:`IOError` is raised
fr: si :python:`mode` n'est pas spécifié et que la table existe déjà, une exception :python:`IOError` est déclenchée

source: For record insertion, updating, deletion and selection the syntax is the same as for the :ref:`pure-Python module <pure-python-engine>`. The SQLite primary key rowid is used like the key :python:`__id__` to identify records
fr: Pour l'insertion, la sélection, la mise à jour et la suppression, la syntaxe est la même que pour le :ref:`module en pur Python <pure-python-engine>`.

source: To insert many records at a time,
fr: Pour insérer de nombreux enregistrements en une seule fois,

source: will be much faster than
fr: sera beaucoup plus rapide que

source: Note that you can't use the :python:`drop_field()` method, since dropping fields is not supported by SQLite
fr: La seule différence est qu'on ne peut pas utiliser la méthode :python:`drop_field()`, parce que la suppression de champs n'est pas supportée par SQLite

source: Conversions between Python types and SQLite field types use the behaviour of the Python SQLite module. :python:`datetime.date`, :python:`datetime.time` and :python:`datetime.datetime` instances are stored as ISO dates/datetimes
fr: Si vous voulez que des champs soient renvoyés comme instances de :python:`datetime.date`, :python:`datetime.time` ou :python:`datetime.datetime`, vous devez le spécifier quand vous créez ou ouvrez la table, en utilisant les méthodes is_date(nom_champ), is_time(nom_champ) ou is_datetime(nom_champ)

source: Selection methods return dictionaries, with SQLite types converted to Python types like this
fr: Les méthodes de sélection renvoient des dictionnaires, dans lesquels les types SQLite sont convertis en types Python de cette façon

source: If you want fields to be returned as instances of datetime.date, datetime.time or datetime.datetime instances, you can specify it when creating or opening the table, using methods :func:`is_date(field_name) <pydblite.sqlite.Table.is_date>`, :func:`is_time(field_name) <pydblite.sqlite.Table.is_time>` or :func:`is_datetime(field_name) <pydblite.sqlite.Table.is_datetime>`.
fr: Si vous voulez que des champs soient renvoyés comme instances de datetime.date, datetime.time ou datetime.datetime, vous devez le spécifier quand vous créez ou ouvrez la table, en utilisant les méthodes :func:`is_date(field_name) <pydblite.sqlite.Table.is_date>`, :func:`is_time(field_name) <pydblite.sqlite.Table.is_time>` ou :func:`is_datetime(field_name) <pydblite.sqlite.Table.is_datetime>`.

source: cursor and commit
fr: cursor et commit

source: Instances of :class:`Database <pydblite.sqlite.Database>` and :class:`Table <pydblite.sqlite.Table>` have the attribute :attr:`cursor <pydblite.sqlite.Database.cursor>`, the SQLite connections cursor, so you can also execute SQL expressions by
fr: Les intances de :class:`Database <pydblite.sqlite.Database>` et :class:`Table <pydblite.sqlite.Table>` ont toutes l'attribut :attr:`cursor <pydblite.sqlite.Database.cursor>`, le curseur de la connection SQLite. On peut donc exécuter des expressions SQL par

source: and get the result by
fr: et récupérer les résultats par

source: the method :func:`commit() <pydblite.sqlite.Database.commit>` saves the changes to a database after a transaction
fr: la méthode :func:`commit() <pydblite.sqlite.Database.commit>` pour confirmer les changements à la base de données en fin de transaction
